{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "trainable": true, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "trainable": true, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "input_dim": 16384, "output_dim": 64}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "input_dim": 64, "output_dim": 16}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "input_dim": 16, "output_dim": 1}}], "keras_version": "1.2.0"}